Revit 2027 API
SlabShapeCreaseType Enumeration
 The type of a SlabShapeCrease
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SlabShapeCreaseType
Public Enumeration SlabShapeCreaseType
public enum class SlabShapeCreaseType
type SlabShapeCreaseType
Members
Member name | Value | Description
Auto | 3 |  the crease is automatically generated.
Boundary | 1 |  The crease is on boundary.
Invalid | 0 |  The crease is invalid.
UserDrawn | 2 |  The crease is created by user.
See Also
Reference
Autodesk.Revit.DB Namespace